RT-Thread/rt-thread/bsp/stm32/stm32u575-st-nucleo/board/CubeMX_Config/Drivers/STM32U5xx_HAL_Driver/Src/stm32u5xx_hal_rcc.c
/* Private function prototypes -----------------------------------------------*/
/** @addtogroup RCC_Private_Functions
  * @{
  */
/**
  * @brief  Update number of Flash wait states in line with MSI range and current
            voltage range.
  * @param  msirange  MSI range value from RCC_MSIRANGE_0 to RCC_MSIRANGE_15
  * @retval HAL status
  */
static HAL_StatusTypeDef RCC_SetFlashLatencyFromMSIRange(uint32_t msirange)
{
  uint32_t vos;
  uint32_t latency;  /* default value 0WS */

  if (__HAL_RCC_PWR_IS_CLK_ENABLED())
  {
    vos = HAL_PWREx_GetVoltageRange();
  }
  else
  {
    __HAL_RCC_PWR_CLK_ENABLE();
    vos = HAL_PWREx_GetVoltageRange();
    __HAL_RCC_PWR_CLK_DISABLE();
  }

  if ((vos == PWR_REGULATOR_VOLTAGE_SCALE1) || (vos == PWR_REGULATOR_VOLTAGE_SCALE2))
  {

    if (msirange < RCC_MSIRANGE_1)
    {
      /* MSI = 48Mhz */
      latency = FLASH_LATENCY_1; /* 1WS */
    }
    else
    {
      /*  MSI < 48Mhz */
      latency = FLASH_LATENCY_0; /* 0WS */
    }
  }
  else
  {
    if (msirange < RCC_MSIRANGE_1)
    {
      /* MSI = 48Mhz */
      if (vos == PWR_REGULATOR_VOLTAGE_SCALE3)
      {
        latency = FLASH_LATENCY_3; /* 3WS */
      }
      else
      {
        return HAL_ERROR;
      }
    }
    else
    {
      if (msirange > RCC_MSIRANGE_2)

      {
        if (vos == PWR_REGULATOR_VOLTAGE_SCALE4)
        {
          if (msirange > RCC_MSIRANGE_3)
          {
            latency = FLASH_LATENCY_0; /* 1WS */
          }
          else
          {
            latency = FLASH_LATENCY_1; /* 0WS */
          }
        }
        else
        {
          latency = FLASH_LATENCY_0; /* 0WS */
        }
      }
      else
      {
        if (msirange == RCC_MSIRANGE_1)

        {
          if (vos == PWR_REGULATOR_VOLTAGE_SCALE3)
          {
            latency = FLASH_LATENCY_1; /* 1WS */
          }
          else
          {
            latency = FLASH_LATENCY_2; /* 2WS */
          }
        }
        else
        {
          latency = FLASH_LATENCY_1; /* 1WS */
        }
      }
    }
  }

  __HAL_FLASH_SET_LATENCY(latency);

  /* Check that the new number of wait states is taken into account to access the Flash
  memory by reading the FLASH_ACR register */
  if ((FLASH->ACR & FLASH_ACR_LATENCY) != latency)
  {
    return HAL_ERROR;
  }

  return HAL_OK;
}

/**
  * @}
  */
#endif /* HAL_RCC_MODULE_ENABLED */
/**
  * @}
  */

/**
  * @}
  */
